piernov/arduino-STM32L4/boards.txt
menu.usb=USB Type
menu.region_flags=Region
menu.version_flags=Board version
menu.dosfs=DOSFS
menu.speed=CPU Speed
menu.opt=Optimize


##############################################################

# Lacuna Space LS200
# ---------------------------------------
Lacuna-LS200.name=Lacuna-LS200
Lacuna-LS200.vid.0=0x1209
Lacuna-LS200.pid.0=0x6667

Lacuna-LS200.upload.tool=stm32l4_dfu
Lacuna-LS200.upload.protocol=dfu
Lacuna-LS200.upload.maximum_size=1032192
Lacuna-LS200.upload.use_1200bps_touch=true
Lacuna-LS200.upload.wait_for_upload_port=false
Lacuna-LS200.upload.native_usb=false

Lacuna-LS200.build.mcu=cortex-m4
Lacuna-LS200.build.f_cpu=80000000L
Lacuna-LS200.build.board=STM32L4_LS200
Lacuna-LS200.build.arch=STM32L4
Lacuna-LS200.build.core=stm32l4
Lacuna-LS200.build.vid=0x1209
Lacuna-LS200.build.pid=0x6667
Lacuna-LS200.build.did=0xffff
Lacuna-LS200.build.usb_manufacturer="Lacuna Space"
Lacuna-LS200.build.usb_product="LS200"
Lacuna-LS200.build.extra_flags=-DSTM32L476xx -D__FPU_PRESENT=1 -march=armv7e-m -mthumb -mfloat-abi=hard -mfpu=fpv4-sp-d16 -mabi=aapcs -mslow-flash-data -fsingle-precision-constant {build.usb_flags} {build.dosfs_flags} {build.region_flags} {build.version_flags}
Lacuna-LS200.build.ldscript=linker_scripts/STM32L476RE_FLASH.ld
Lacuna-LS200.build.openocdscript=openocd_scripts/stm32l476re_dragonfly.cfg
Lacuna-LS200.build.variant=STM32L476RE-LS200
Lacuna-LS200.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L4xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l476 -larm_cortexM4lf_math
Lacuna-LS200.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L4xx/Include" "-I{runtime.platform.path}/system/STM32L4xx/Include" 

Lacuna-LS200.menu.usb.cdc=Serial
Lacuna-LS200.menu.usb.cdc.build.usb_type=USB_TYPE_CDC
Lacuna-LS200.menu.usb.cdc_msc=Serial + Mass Storage
Lacuna-LS200.menu.usb.cdc_msc.build.usb_type=USB_TYPE_CDC_MSC
# Lacuna-LS200.menu.usb.cdc_hid=Serial + Keyboard + Mouse
# Lacuna-LS200.menu.usb.cdc_hid.build.usb_type=USB_TYPE_CDC_HID
# Lacuna-LS200.menu.usb.cdc_msc_hid=Serial + Mass Storage + Keyboard + Mouse
# Lacuna-LS200.menu.usb.cdc_msc_hid.build.usb_type=USB_TYPE_CDC_MSC_HID
Lacuna-LS200.menu.usb.none=No USB (low-power)
Lacuna-LS200.menu.usb.none.build.usb_type=USB_TYPE_NONE

Lacuna-LS200.menu.region_flags.EU868=Europe 868
Lacuna-LS200.menu.region_flags.EU868.build.region=R_EU868
Lacuna-LS200.menu.region_flags.US915=US 915
Lacuna-LS200.menu.region_flags.US915.build.region=R_US915
Lacuna-LS200.menu.region_flags.AU915=AU 915
Lacuna-LS200.menu.region_flags.AU915.build.region=R_AU915
Lacuna-LS200.menu.region_flags.AS923=Asia AS923
Lacuna-LS200.menu.region_flags.AS923.build.region=R_AS923
Lacuna-LS200.menu.region_flags.IN865=India 865
Lacuna-LS200.menu.region_flags.IN865.build.region=R_IN865

Lacuna-LS200.build.dosfs_sdcard=0
Lacuna-LS200.build.dosfs_sflash=0

Lacuna-LS200.menu.version_flags.V3=V3
Lacuna-LS200.menu.version_flags.V3.build.version=BOARD_LS200_V3
Lacuna-LS200.menu.version_flags.V4=V4
Lacuna-LS200.menu.version_flags.V4.build.version=BOARD_LS200_V4
Lacuna-LS200.menu.version_flags.V4.build.dosfs_sdcard=0
Lacuna-LS200.menu.version_flags.V4.build.dosfs_sflash=0
Lacuna-LS200.menu.version_flags.V2=V2
Lacuna-LS200.menu.version_flags.V2.build.version=BOARD_LS200_V2

Lacuna-LS200.menu.speed.80=80 MHz
Lacuna-LS200.menu.speed.80.build.f_cpu=80000000L
Lacuna-LS200.menu.speed.72=72 MHz
Lacuna-LS200.menu.speed.72.build.f_cpu=72000000L
Lacuna-LS200.menu.speed.64=64 MHz
Lacuna-LS200.menu.speed.64.build.f_cpu=64000000L
Lacuna-LS200.menu.speed.48=48 MHz
Lacuna-LS200.menu.speed.48.build.f_cpu=48000000L
Lacuna-LS200.menu.speed.32=32 MHz
Lacuna-LS200.menu.speed.32.build.f_cpu=32000000L
Lacuna-LS200.menu.speed.24=24 MHz
Lacuna-LS200.menu.speed.24.build.f_cpu=24000000L
Lacuna-LS200.menu.speed.16=16 MHz
Lacuna-LS200.menu.speed.16.build.f_cpu=16000000L
Lacuna-LS200.menu.speed.8=8 MHz (No USB)
Lacuna-LS200.menu.speed.8.build.f_cpu=8000000L
Lacuna-LS200.menu.speed.4=4 MHz (No USB)
Lacuna-LS200.menu.speed.4.build.f_cpu=4000000L
Lacuna-LS200.menu.speed.2=2 MHz (No USB)
Lacuna-LS200.menu.speed.2.build.f_cpu=2000000L
Lacuna-LS200.menu.speed.1=1 MHz (No USB)
Lacuna-LS200.menu.speed.1.build.f_cpu=1000000L

Lacuna-LS200.menu.opt.o3=Fastest
Lacuna-LS200.menu.opt.o3.build.flags.optimize=-O3
Lacuna-LS200.menu.opt.o3.build.flags.ldspecs=
Lacuna-LS200.menu.opt.os=Smallest Code
Lacuna-LS200.menu.opt.os.build.flags.optimize=-Os
Lacuna-LS200.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
# Lacuna-LS200.menu.opt.o1=Fast
# Lacuna-LS200.menu.opt.o1.build.flags.optimize=-O1
# Lacuna-LS200.menu.opt.o1.build.flags.ldspecs=
# Lacuna-LS200.menu.opt.o2=Faster
# Lacuna-LS200.menu.opt.o2.build.flags.optimize=-O2
# Lacuna-LS200.menu.opt.o2.build.flags.ldspecs=



# Tlera Dragonfly
# ---------------------------------------
Dragonfly-L476RE.name=Dragonfly-L476RE
Dragonfly-L476RE.vid.0=0x1209
Dragonfly-L476RE.pid.0=0x6667

Dragonfly-L476RE.upload.tool=stm32l4_dfu
Dragonfly-L476RE.upload.protocol=dfu
Dragonfly-L476RE.upload.maximum_size=507904
Dragonfly-L476RE.upload.use_1200bps_touch=true
Dragonfly-L476RE.upload.wait_for_upload_port=false
Dragonfly-L476RE.upload.native_usb=false

Dragonfly-L476RE.build.mcu=cortex-m4
Dragonfly-L476RE.build.f_cpu=80000000L
Dragonfly-L476RE.build.board=STM32L4_DRAGONFLY
Dragonfly-L476RE.build.arch=STM32L4
Dragonfly-L476RE.build.core=stm32l4
Dragonfly-L476RE.build.vid=0x1209
Dragonfly-L476RE.build.pid=0x6667
Dragonfly-L476RE.build.did=0xffff
Dragonfly-L476RE.build.usb_manufacturer="Tlera Corporation"
Dragonfly-L476RE.build.usb_product="Dragonfly"
Dragonfly-L476RE.build.extra_flags=-DSTM32L476xx -D__FPU_PRESENT=1 -march=armv7e-m -mthumb -mfloat-abi=hard -mfpu=fpv4-sp-d16 -mabi=aapcs -mslow-flash-data -fsingle-precision-constant {build.usb_flags} {build.dosfs_flags}
Dragonfly-L476RE.build.ldscript=linker_scripts/STM32L476RE_FLASH.ld
Dragonfly-L476RE.build.openocdscript=openocd_scripts/stm32l476re_dragonfly.cfg
Dragonfly-L476RE.build.variant=STM32L476RE-Dragonfly
Dragonfly-L476RE.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L4xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l476 -larm_cortexM4lf_math
Dragonfly-L476RE.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L4xx/Include" "-I{runtime.platform.path}/system/STM32L4xx/Include" 

Dragonfly-L476RE.menu.usb.cdc=Serial
Dragonfly-L476RE.menu.usb.cdc.build.usb_type=USB_TYPE_CDC
Dragonfly-L476RE.menu.usb.cdc_msc=Serial + Mass Storage
Dragonfly-L476RE.menu.usb.cdc_msc.build.usb_type=USB_TYPE_CDC_MSC
Dragonfly-L476RE.menu.usb.cdc_hid=Serial + Keyboard + Mouse
Dragonfly-L476RE.menu.usb.cdc_hid.build.usb_type=USB_TYPE_CDC_HID
Dragonfly-L476RE.menu.usb.cdc_msc_hid=Serial + Mass Storage + Keyboard + Mouse
Dragonfly-L476RE.menu.usb.cdc_msc_hid.build.usb_type=USB_TYPE_CDC_MSC_HID
Dragonfly-L476RE.menu.usb.none=No USB
Dragonfly-L476RE.menu.usb.none.build.usb_type=USB_TYPE_NONE

Dragonfly-L476RE.menu.dosfs.sflash=SFLASH (QSPI)
Dragonfly-L476RE.menu.dosfs.sflash.build.dosfs_sdcard=0
Dragonfly-L476RE.menu.dosfs.sflash.build.dosfs_sflash=2
Dragonfly-L476RE.menu.dosfs.sdspi=SDCARD (SPI)
Dragonfly-L476RE.menu.dosfs.sdspi.build.dosfs_sdcard=1
Dragonfly-L476RE.menu.dosfs.sdspi.build.dosfs_sflash=0
Dragonfly-L476RE.menu.dosfs.sdmmc=SDCARD (SDIO Default Speed)
Dragonfly-L476RE.menu.dosfs.sdmmc.build.dosfs_sdcard=2
Dragonfly-L476RE.menu.dosfs.sdmmc.build.dosfs_sflash=0
Dragonfly-L476RE.menu.dosfs.sdmmc1=SDCARD (SDIO High Speed)
Dragonfly-L476RE.menu.dosfs.sdmmc1.build.dosfs_sdcard=3
Dragonfly-L476RE.menu.dosfs.sdmmc1.build.dosfs_sflash=0
Dragonfly-L476RE.menu.dosfs.none=None
Dragonfly-L476RE.menu.dosfs.none.build.dosfs_sdcard=0
Dragonfly-L476RE.menu.dosfs.none.build.dosfs_sflash=0

Dragonfly-L476RE.menu.speed.80=80 MHz
Dragonfly-L476RE.menu.speed.80.build.f_cpu=80000000L
Dragonfly-L476RE.menu.speed.72=72 MHz
Dragonfly-L476RE.menu.speed.72.build.f_cpu=72000000L
Dragonfly-L476RE.menu.speed.64=64 MHz
Dragonfly-L476RE.menu.speed.64.build.f_cpu=64000000L
Dragonfly-L476RE.menu.speed.48=48 MHz
Dragonfly-L476RE.menu.speed.48.build.f_cpu=48000000L
Dragonfly-L476RE.menu.speed.32=32 MHz
Dragonfly-L476RE.menu.speed.32.build.f_cpu=32000000L
Dragonfly-L476RE.menu.speed.24=24 MHz
Dragonfly-L476RE.menu.speed.24.build.f_cpu=24000000L
Dragonfly-L476RE.menu.speed.16=16 MHz
Dragonfly-L476RE.menu.speed.16.build.f_cpu=16000000L
Dragonfly-L476RE.menu.speed.8=8 MHz (No USB)
Dragonfly-L476RE.menu.speed.8.build.f_cpu=8000000L
Dragonfly-L476RE.menu.speed.4=4 MHz (No USB)
Dragonfly-L476RE.menu.speed.4.build.f_cpu=4000000L
Dragonfly-L476RE.menu.speed.2=2 MHz (No USB)
Dragonfly-L476RE.menu.speed.2.build.f_cpu=2000000L
Dragonfly-L476RE.menu.speed.1=1 MHz (No USB)
Dragonfly-L476RE.menu.speed.1.build.f_cpu=1000000L

Dragonfly-L476RE.menu.opt.os=Smallest Code
Dragonfly-L476RE.menu.opt.os.build.flags.optimize=-Os
Dragonfly-L476RE.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
Dragonfly-L476RE.menu.opt.o1=Fast
Dragonfly-L476RE.menu.opt.o1.build.flags.optimize=-O1
Dragonfly-L476RE.menu.opt.o1.build.flags.ldspecs=
Dragonfly-L476RE.menu.opt.o2=Faster
Dragonfly-L476RE.menu.opt.o2.build.flags.optimize=-O2
Dragonfly-L476RE.menu.opt.o2.build.flags.ldspecs=
Dragonfly-L476RE.menu.opt.o3=Fastest
Dragonfly-L476RE.menu.opt.o3.build.flags.optimize=-O3
Dragonfly-L476RE.menu.opt.o3.build.flags.ldspecs=

# Tlera Dragonfly (V2)
# ---------------------------------------
Dragonfly-L496RG.name=Dragonfly-L496RG
Dragonfly-L496RG.vid.0=0x1209
Dragonfly-L496RG.pid.0=0x6666

Dragonfly-L496RG.upload.tool=stm32l4_dfu
Dragonfly-L496RG.upload.protocol=dfu
Dragonfly-L496RG.upload.maximum_size=1032192
Dragonfly-L496RG.upload.use_1200bps_touch=true
Dragonfly-L496RG.upload.wait_for_upload_port=false
Dragonfly-L496RG.upload.native_usb=false

Dragonfly-L496RG.build.mcu=cortex-m4
Dragonfly-L496RG.build.f_cpu=80000000L
Dragonfly-L496RG.build.board=STM32L4_DRAGONFLY
Dragonfly-L496RG.build.arch=STM32L4
Dragonfly-L496RG.build.core=stm32l4
Dragonfly-L496RG.build.vid=0x1209
Dragonfly-L496RG.build.pid=0x6666
Dragonfly-L496RG.build.did=0xffff
Dragonfly-L496RG.build.usb_manufacturer="Tlera Corporation"
Dragonfly-L496RG.build.usb_product="Dragonfly"
Dragonfly-L496RG.build.extra_flags=-DSTM32L496xx -D__FPU_PRESENT=1 -march=armv7e-m -mthumb -mfloat-abi=hard -mfpu=fpv4-sp-d16 -mabi=aapcs -mslow-flash-data -fsingle-precision-constant {build.usb_flags} {build.dosfs_flags}
Dragonfly-L496RG.build.ldscript=linker_scripts/STM32L496RG_FLASH.ld
Dragonfly-L496RG.build.openocdscript=openocd_scripts/stm32l496rg_dragonfly.cfg
Dragonfly-L496RG.build.variant=STM32L496RG-Dragonfly
Dragonfly-L496RG.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L4xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l496 -larm_cortexM4lf_math
Dragonfly-L496RG.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L4xx/Include" "-I{runtime.platform.path}/system/STM32L4xx/Include" 

Dragonfly-L496RG.menu.usb.cdc=Serial
Dragonfly-L496RG.menu.usb.cdc.build.usb_type=USB_TYPE_CDC
Dragonfly-L496RG.menu.usb.cdc_msc=Serial + Mass Storage
Dragonfly-L496RG.menu.usb.cdc_msc.build.usb_type=USB_TYPE_CDC_MSC
Dragonfly-L496RG.menu.usb.cdc_hid=Serial + Keyboard + Mouse
Dragonfly-L496RG.menu.usb.cdc_hid.build.usb_type=USB_TYPE_CDC_HID
Dragonfly-L496RG.menu.usb.cdc_msc_hid=Serial + Mass Storage + Keyboard + Mouse
Dragonfly-L496RG.menu.usb.cdc_msc_hid.build.usb_type=USB_TYPE_CDC_MSC_HID
Dragonfly-L496RG.menu.usb.none=No USB
Dragonfly-L496RG.menu.usb.none.build.usb_type=USB_TYPE_NONE

Dragonfly-L496RG.menu.dosfs.sflash=SFLASH (QSPI)
Dragonfly-L496RG.menu.dosfs.sflash.build.dosfs_sdcard=0
Dragonfly-L496RG.menu.dosfs.sflash.build.dosfs_sflash=2
Dragonfly-L496RG.menu.dosfs.sdspi=SDCARD (SPI)
Dragonfly-L496RG.menu.dosfs.sdspi.build.dosfs_sdcard=1
Dragonfly-L496RG.menu.dosfs.sdspi.build.dosfs_sflash=0
Dragonfly-L496RG.menu.dosfs.sdmmc=SDCARD (SDIO Default Speed)
Dragonfly-L496RG.menu.dosfs.sdmmc.build.dosfs_sdcard=2
Dragonfly-L496RG.menu.dosfs.sdmmc.build.dosfs_sflash=0
Dragonfly-L496RG.menu.dosfs.sdmmc1=SDCARD (SDIO High Speed)
Dragonfly-L496RG.menu.dosfs.sdmmc1.build.dosfs_sdcard=3
Dragonfly-L496RG.menu.dosfs.sdmmc1.build.dosfs_sflash=0
Dragonfly-L496RG.menu.dosfs.none=None
Dragonfly-L496RG.menu.dosfs.none.build.dosfs_sdcard=0
Dragonfly-L496RG.menu.dosfs.none.build.dosfs_sflash=0

